# Pandas Introduction

In [1]:
import numpy as np
import pandas as pd

## Series object

In [2]:
ser = pd.Series([10,20,30,40,50])

ser

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [3]:
# Index access

ser[0]

10

### Element-wise operations

In [4]:
ages = pd.Series([31,22,43,44,55])

ages

0    31
1    22
2    43
3    44
4    55
dtype: int64

In [5]:
ages * 2

0     62
1     44
2     86
3     88
4    110
dtype: int64

In [9]:
ages + 10

0    41
1    32
2    53
3    54
4    65
dtype: int64

### Boolean selection

In [10]:
ages>40

0    False
1    False
2     True
3     True
4     True
dtype: bool

In [11]:
# Returns the rows that are True

ages[ages>40]

2    43
3    44
4    55
dtype: int64

---

## DataFrame object

In [6]:
# Create a DataFrame using a dictionary

data = {"Name": ["Tim Miller", "Ann Carter", "Ellen Lee", "Sam Carr", "Al Ball", "Carl Zee", "Sara Martin"], 
        "Gender": ["Male", "Female", "Female", "Male", "Male", "Male", "Female"],
        "Age": [32, 44, 21, 19, 45, 27, 39]}

df = pd.DataFrame(data)

df

          Name  Gender  Age
0   Tim Miller    Male   32
1   Ann Carter  Female   44
2    Ellen Lee  Female   21
3     Sam Carr    Male   19
4      Al Ball    Male   45
5     Carl Zee    Male   27
6  Sara Martin  Female   39

In [13]:
# Show first 5 rows

df.head() # == df.head(5)

         Name  Gender  Age
0  Tim Miller    Male   32
1  Ann Carter  Female   44
2   Ellen Lee  Female   21
3    Sam Carr    Male   19
4     Al Ball    Male   45

In [14]:
# Show last 5 rows

df.tail()  # == df.tail(5)

          Name  Gender  Age
2    Ellen Lee  Female   21
3     Sam Carr    Male   19
4      Al Ball    Male   45
5     Carl Zee    Male   27
6  Sara Martin  Female   39

In [15]:
# Returns a column/Series object

df['Name']     # dictionary notation

0     Tim Miller
1     Ann Carter
2      Ellen Lee
3       Sam Carr
4        Al Ball
5       Carl Zee
6    Sara Martin
Name: Name, dtype: object

In [16]:
df.Name    # attribute notation; with tab completion

0     Tim Miller
1     Ann Carter
2      Ellen Lee
3       Sam Carr
4        Al Ball
5       Carl Zee
6    Sara Martin
Name: Name, dtype: object

In [17]:
# Assign a single value to every row in a column

df["Birth Year"] = 1989

df

          Name  Gender  Age  Birth Year
0   Tim Miller    Male   32        1989
1   Ann Carter  Female   44        1989
2    Ellen Lee  Female   21        1989
3     Sam Carr    Male   19        1989
4      Al Ball    Male   45        1989
5     Carl Zee    Male   27        1989
6  Sara Martin  Female   39        1989

In [18]:
# Assign specific values to the rows in a column

df["Married"] = ['Yes', 'Yes', 'No', 'No', 'Yes', 'Yes', 'No']     # must match the length of the DataFrame

df

          Name  Gender  Age  Birth Year Married
0   Tim Miller    Male   32        1989     Yes
1   Ann Carter  Female   44        1989     Yes
2    Ellen Lee  Female   21        1989      No
3     Sam Carr    Male   19        1989      No
4      Al Ball    Male   45        1989     Yes
5     Carl Zee    Male   27        1989     Yes
6  Sara Martin  Female   39        1989      No

## Selection and Filtering
### Column selection

In [19]:
# Create a new DataFrame

df = pd.DataFrame(np.arange(100).reshape(10,10), columns = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'])

df

    a   b   c   d   e   f   g   h   i   j
0   0   1   2   3   4   5   6   7   8   9
1  10  11  12  13  14  15  16  17  18  19
2  20  21  22  23  24  25  26  27  28  29
3  30  31  32  33  34  35  36  37  38  39
4  40  41  42  43  44  45  46  47  48  49
5  50  51  52  53  54  55  56  57  58  59
6  60  61  62  63  64  65  66  67  68  69
7  70  71  72  73  74  75  76  77  78  79
8  80  81  82  83  84  85  86  87  88  89
9  90  91  92  93  94  95  96  97  98  99

In [20]:
df['a']

0     0
1    10
2    20
3    30
4    40
5    50
6    60
7    70
8    80
9    90
Name: a, dtype: int32

In [21]:
df[["a", "e", "j"]]    # providing a list selects multiple columns

    a   e   j
0   0   4   9
1  10  14  19
2  20  24  29
3  30  34  39
4  40  44  49
5  50  54  59
6  60  64  69
7  70  74  79
8  80  84  89
9  90  94  99

In [22]:
df[["j", "e", "a"]]

    j   e   a
0   9   4   0
1  19  14  10
2  29  24  20
3  39  34  30
4  49  44  40
5  59  54  50
6  69  64  60
7  79  74  70
8  89  84  80
9  99  94  90

### Row selection

In [23]:
df[:1]     # use slice syntax to select rows

   a  b  c  d  e  f  g  h  i  j
0  0  1  2  3  4  5  6  7  8  9

In [24]:
df[5:9]

    a   b   c   d   e   f   g   h   i   j
5  50  51  52  53  54  55  56  57  58  59
6  60  61  62  63  64  65  66  67  68  69
7  70  71  72  73  74  75  76  77  78  79
8  80  81  82  83  84  85  86  87  88  89

In [25]:
# boolean

df["j"] > 40

0    False
1    False
2    False
3    False
4     True
5     True
6     True
7     True
8     True
9     True
Name: j, dtype: bool

In [26]:
# boolean selection

df[df["j"] > 40]

    a   b   c   d   e   f   g   h   i   j
4  40  41  42  43  44  45  46  47  48  49
5  50  51  52  53  54  55  56  57  58  59
6  60  61  62  63  64  65  66  67  68  69
7  70  71  72  73  74  75  76  77  78  79
8  80  81  82  83  84  85  86  87  88  89
9  90  91  92  93  94  95  96  97  98  99

### Row and Column selection with loc
Allows you to select a subset of the rows and columns using the label/name of the row/column

In [30]:
df

    a   b   c   d   e   f   g   h   i   j
0   0   1   2   3   4   5   6   7   8   9
1  10  11  12  13  14  15  16  17  18  19
2  20  21  22  23  24  25  26  27  28  29
3  30  31  32  33  34  35  36  37  38  39
4  40  41  42  43  44  45  46  47  48  49
5  50  51  52  53  54  55  56  57  58  59
6  60  61  62  63  64  65  66  67  68  69
7  70  71  72  73  74  75  76  77  78  79
8  80  81  82  83  84  85  86  87  88  89
9  90  91  92  93  94  95  96  97  98  99

In [31]:
# loc (inclusive) implies the name/label of the row, column

df.loc[:5, "b"]

0     1
1    11
2    21
3    31
4    41
5    51
Name: b, dtype: int32

In [32]:
df.loc[6:, 'a':'e']    # consecutive (loc selection is inclusive)

    a   b   c   d   e
6  60  61  62  63  64
7  70  71  72  73  74
8  80  81  82  83  84
9  90  91  92  93  94

In [33]:
df.loc[2:6, ['c', 'f', 'i']]     # not consecutive

    c   f   i
2  22  25  28
3  32  35  38
4  42  45  48
5  52  55  58
6  62  65  68

### Row and Column selection with iloc
Allows you to select a subset of the rows and columns using the index position of the row/column

In [34]:
# iloc is for integer/index selection  (iloc selection is exclusive)

df.iloc[2:6, [2, 5, 8]]

    c   f   i
2  22  25  28
3  32  35  38
4  42  45  48
5  52  55  58

In [35]:
df.iloc[:, :-1]  # Returns all rows, and all columns except the last one

    a   b   c   d   e   f   g   h   i
0   0   1   2   3   4   5   6   7   8
1  10  11  12  13  14  15  16  17  18
2  20  21  22  23  24  25  26  27  28
3  30  31  32  33  34  35  36  37  38
4  40  41  42  43  44  45  46  47  48
5  50  51  52  53  54  55  56  57  58
6  60  61  62  63  64  65  66  67  68
7  70  71  72  73  74  75  76  77  78
8  80  81  82  83  84  85  86  87  88
9  90  91  92  93  94  95  96  97  98

In [36]:
df.iloc[:, -1] # Returns all rows and only the last column

0     9
1    19
2    29
3    39
4    49
5    59
6    69
7    79
8    89
9    99
Name: j, dtype: int32

In [37]:
df.iloc[[5, 0, 3], [9, 5, 0]]  # Returns rows and columns in the order listed

    j   f   a
5  59  55  50
0   9   5   0
3  39  35  30

---

# Data Acquisition

## xlsx (Excel)

In [38]:
excel_df = pd.read_excel("Olympics.xlsx", sheet_name = 0)

excel_df.head()

,id,name,nationality,sex,dob,height,weight,sport,gold,silver,bronze
0,736041664,A Jesus Garcia,ESP,male,10/17/69,1.72,64.0,athletics,0,0,0
1,532037425,A Lam Shin,KOR,female,9/23/86,1.68,56.0,fencing,0,0,0
2,435962603,Aaron Brown,CAN,male,5/27/92,1.98,79.0,athletics,0,0,1
3,521041435,Aaron Cook,MDA,male,1/2/91,1.83,80.0,taekwondo,0,0,0
4,33922579,Aaron Gate,NZL,male,11/26/90,1.81,71.0,cycling,0,0,0

## json

In [39]:
# Using pandas

json_df = pd.read_json("Olympics.json", orient="records")

json_df.head()

,id,name,nationality,sex,dob,height,weight,sport,gold,silver,bronze
0,736041664,A Jesus Garcia,ESP,male,10/17/69,1.72,64.0,athletics,0,0,0
1,532037425,A Lam Shin,KOR,female,9/23/86,1.68,56.0,fencing,0,0,0
2,435962603,Aaron Brown,CAN,male,5/27/92,1.98,79.0,athletics,0,0,1
3,521041435,Aaron Cook,MDA,male,1/2/91,1.83,80.0,taekwondo,0,0,0
4,33922579,Aaron Gate,NZL,male,11/26/90,1.81,71.0,cycling,0,0,0

#### Another json method

In [40]:
# Using json library
import json

with open("Olympics.json", 'r') as f:
    datastore = json.load(f)
    
json_df2 = pd.DataFrame(datastore)

json_df2.head()

,id,name,nationality,sex,dob,height,weight,sport,gold,silver,bronze
0,736041664,A Jesus Garcia,ESP,male,10/17/69,1.72,64.0,athletics,0,0,0
1,532037425,A Lam Shin,KOR,female,9/23/86,1.68,56.0,fencing,0,0,0
2,435962603,Aaron Brown,CAN,male,5/27/92,1.98,79.0,athletics,0,0,1
3,521041435,Aaron Cook,MDA,male,1/2/91,1.83,80.0,taekwondo,0,0,0
4,33922579,Aaron Gate,NZL,male,11/26/90,1.81,71.0,cycling,0,0,0

## csv

In [41]:
csv_df = pd.read_csv("Olympics.csv")

csv_df.head()

,id,name,nationality,sex,dob,height,weight,sport,gold,silver,bronze
0,736041664,A Jesus Garcia,ESP,male,10/17/69,1.72,64.0,athletics,0,0,0
1,532037425,A Lam Shin,KOR,female,9/23/86,1.68,56.0,fencing,0,0,0
2,435962603,Aaron Brown,CAN,male,5/27/92,1.98,79.0,athletics,0,0,1
3,521041435,Aaron Cook,MDA,male,1/2/91,1.83,80.0,taekwondo,0,0,0
4,33922579,Aaron Gate,NZL,male,11/26/90,1.81,71.0,cycling,0,0,0

## tsv

In [42]:
tsv_df = pd.read_csv("Olympics.tsv", sep="\t")

tsv_df.head()

,id,name,nationality,sex,dob,height,weight,sport,gold,silver,bronze
0,736041664,A Jesus Garcia,ESP,male,10/17/69,1.72,64.0,athletics,0,0,0
1,532037425,A Lam Shin,KOR,female,9/23/86,1.68,56.0,fencing,0,0,0
2,435962603,Aaron Brown,CAN,male,5/27/92,1.98,79.0,athletics,0,0,1
3,521041435,Aaron Cook,MDA,male,1/2/91,1.83,80.0,taekwondo,0,0,0
4,33922579,Aaron Gate,NZL,male,11/26/90,1.81,71.0,cycling,0,0,0

## mysql

**host** — Provides the hostName of MySQL server. Normally, if installed on local machine, it's termed ‘localhost’. In cases like cloud / dedicated third party server, provide the IP address.

**database** - Provides the name of the database to use.

**user & password** - The credentials to access the database.

**use_pure** — Symbolize Python implementation

In [70]:
!pip install mysql-connector-python

import mysql.connector as connection

try:  
    mydb = connection.connect(host="localhost", database ='Student', user="root", passwd="root", use_pure=True)  
    query = "Select * from studentdetails;"  # SQL query to be executed or a table name.
    result_dataFrame = pd.read_sql(query, mydb)  # Result of the SQL query.
    mydb.close() # close the connection
except Exception as e:  
    mydb.close()  
    print(str(e))

# Output result to .csv
result_dataFrame.to_csv('my_sql.csv')

Requirement already satisfied: mysql-connector-python in c:\users\amrigupt\anaconda\lib\site-packages (9.0.0)

NameError: name 'mydb' is not defined

#### Another MySQL method

In [68]:
!pip install mysqlclient

import MySQLdb
import pandas.io.sql as psql


# setup the database connection.
db=MySQLdb.connect(host=HOST, user=USER, passwd=PW, db=DBNAME)

# create the query
query = "select * from TABLENAME"

# execute the query and assign it to a pandas dataframe
df = psql.read_sql(query, con=db)
# close the database connection
db.close()


# Output result to .csv
df.to_csv('my_sql.csv')

Collecting mysqlclient
  Downloading mysqlclient-2.2.4-cp311-cp311-win_amd64.whl.metadata (4.6 kB)
Downloading mysqlclient-2.2.4-cp311-cp311-win_amd64.whl (203 kB)
   ---------------------------------------- 0.0/203.2 kB ? eta -:--:--
   ---------------------------------------- 0.0/203.2 kB ? eta -:--:--
   -- ------------------------------------- 10.2/203.2 kB ? eta -:--:--
   ----- --------------------------------- 30.7/203.2 kB 217.9 kB/s eta 0:00:01
   --------- ----------------------------- 51.2/203.2 kB 290.5 kB/s eta 0:00:01
   --------------------- ---------------- 112.6/203.2 kB 544.7 kB/s eta 0:00:01
   -------------------------------- ----- 174.1/203.2 kB 748.1 kB/s eta 0:00:01
   -------------------------------------- 203.2/203.2 kB 824.6 kB/s eta 0:00:00
Installing collected packages: mysqlclient
Successfully installed mysqlclient-2.2.4

NameError: name 'HOST' is not defined

#### SQLAlchemy method

In [69]:
!pip install sqlalchemy
import sqlalchemy as sql

# USER is your username, PW is your password, DBHOST is the database host,  DB is the database you want to connect to.
connect_string = 'mysql://USER:PW@DBHOST/DB'
sql_engine = sql.create_engine(connect_string)

# You don't need to worry about cursors or opening/closing database connections.
query = "select * from TABLENAME"
df = pd.read_sql_query(query, sql_engine)

# Output result to .csv
df.to_csv('my_sql.csv')

Requirement already satisfied: sqlalchemy in c:\users\amrigupt\anaconda\lib\site-packages (1.4.45)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\amrigupt\anaconda\lib\site-packages (from sqlalchemy) (3.0.1)

OperationalError: (MySQLdb.OperationalError) (2005, "Unknown server host 'DBHOST' (11001)")
(Background on this error at: https://sqlalche.me/e/14/e3q8)

---

# Getting Help

### Use a "?" (or shift + tab) for function/method signature and Docstring (description)

In [ ]:
#pd.read_excel?

---

# Data Exploration

## Preview dataset

In [46]:
df = pd.read_csv("Olympics.csv")

df.head()

,id,name,nationality,sex,dob,height,weight,sport,gold,silver,bronze
0,736041664,A Jesus Garcia,ESP,male,10/17/69,1.72,64.0,athletics,0,0,0
1,532037425,A Lam Shin,KOR,female,9/23/86,1.68,56.0,fencing,0,0,0
2,435962603,Aaron Brown,CAN,male,5/27/92,1.98,79.0,athletics,0,0,1
3,521041435,Aaron Cook,MDA,male,1/2/91,1.83,80.0,taekwondo,0,0,0
4,33922579,Aaron Gate,NZL,male,11/26/90,1.81,71.0,cycling,0,0,0

In [47]:
# Return a random sample of rows from the dataframe

df.sample(10)

,id,name,nationality,sex,dob,height,weight,sport,gold,silver,bronze
7654,310689410,Mohamed Elhadi Elkawisah,LBA,male,3/8/87,NaN,NaN,judo,0,0,0
3239,455154602,Ezekiel Kemboi,KEN,male,5/25/82,1.67,52.0,athletics,0,0,0
11236,763147414,Yifan Xu,CHN,female,8/8/88,1.65,60.0,tennis,0,0,0
3057,102727571,Emmanuel Daniel,NGR,male,12/17/93,1.74,NaN,football,0,0,1
2462,146589026,David Graf,SUI,male,9/8/89,1.80,79.0,cycling,0,0,0
429,203028845,Alexandre Iddir,FRA,male,2/21/91,1.84,90.0,judo,0,0,0
678,241768985,Anabelle Smith,AUS,female,2/3/93,1.68,55.0,aquatics,0,0,1
10163,733228088,Sungmin Kim,KOR,male,6/29/87,1.90,130.0,judo,0,0,0
5532,136505337,Kathleen Bam,USA,female,12/6/88,1.55,54.0,hockey,0,0,0
10043,565822504,Stefan Brits,RSA,male,1/19/92,1.83,72.0,athletics,0,0,0

### Determine the number of rows and columns in the DataFrame

In [48]:
# (#rows, #columns)

df.shape

(11538, 11)

---

### Use dot-tab to view for object methods

In [49]:
#df.

---

## Feature Selection (drop)
**axis = 0** refers to rows; **axis = 1** refers to columns

In [50]:
# drop features; returns a copy

df = df.drop(['id', 'name'], axis=1)

df.head()

,nationality,sex,dob,height,weight,sport,gold,silver,bronze
0,ESP,male,10/17/69,1.72,64.0,athletics,0,0,0
1,KOR,female,9/23/86,1.68,56.0,fencing,0,0,0
2,CAN,male,5/27/92,1.98,79.0,athletics,0,0,1
3,MDA,male,1/2/91,1.83,80.0,taekwondo,0,0,0
4,NZL,male,11/26/90,1.81,71.0,cycling,0,0,0

---

## Descriptive and summary statistics

In [51]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11538 entries, 0 to 11537
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   nationality  11538 non-null  object
 1   sex          11538 non-null  object
 2   dob          11537 non-null  object
 3   height       11208 non-null  float64
 4   weight       10879 non-null  float64
 5   sport        11538 non-null  object
 6   gold         11538 non-null  int64
 7   silver       11538 non-null  int64
 8   bronze       11538 non-null  int64
dtypes: float64(2), int64(3), object(4)
memory usage: 811.4+ KB

### Describe the numerical data

In [52]:
df.describe()

             height        weight          gold        silver        bronze
count  11208.000000  10879.000000  11538.000000  11538.000000  11538.000000
mean       1.766282     72.068205      0.057722      0.056769      0.061016
std        0.112719     16.177334      0.255910      0.239147      0.243320
min        1.210000     31.000000      0.000000      0.000000      0.000000
25%        1.690000     60.000000      0.000000      0.000000      0.000000
50%        1.760000     70.000000      0.000000      0.000000      0.000000
75%        1.840000     81.000000      0.000000      0.000000      0.000000
max        2.210000    170.000000      5.000000      2.000000      2.000000

### Useful methods for describing numerical data

In [53]:
df["height"].min()
# df["height"].max()
# df["height"].mean()
# df["gold"].sum()

1.21

---

### Describe the categorical data

In [54]:
df.describe(include="object")

       nationality    sex      dob      sport
count        11538  11538    11537      11538
unique         207      2     5595         28
top            USA   male  2/18/93  athletics
freq           567   6333        9       2363

---

### Unique values

In [55]:
df["sport"].unique()

array(['athletics', 'fencing', 'taekwondo', 'cycling', 'triathlon',
       'volleyball', 'aquatics', 'rugby sevens', 'wrestling', 'football',
       'shooting', 'boxing', 'equestrian', 'rowing', 'judo', 'handball',
       'badminton', 'hockey', 'modern pentathlon', 'table tennis',
       'canoe', 'basketball', 'golf', 'archery', 'weightlifting',
       'sailing', 'tennis', 'gymnastics'], dtype=object)

In [56]:
# Alphabetizes results

set(df["sport"])

{'aquatics',
 'archery',
 'athletics',
 'badminton',
 'basketball',
 'boxing',
 'canoe',
 'cycling',
 'equestrian',
 'fencing',
 'football',
 'golf',
 'gymnastics',
 'handball',
 'hockey',
 'judo',
 'modern pentathlon',
 'rowing',
 'rugby sevens',
 'sailing',
 'shooting',
 'table tennis',
 'taekwondo',
 'tennis',
 'triathlon',
 'volleyball',
 'weightlifting',
 'wrestling'}

### Number of unique values

In [57]:
df["sport"].nunique()

28

In [58]:
len(df["sport"].unique())

28

---

## Feature Transformation

In [59]:
df.head()

,nationality,sex,dob,height,weight,sport,gold,silver,bronze
0,ESP,male,10/17/69,1.72,64.0,athletics,0,0,0
1,KOR,female,9/23/86,1.68,56.0,fencing,0,0,0
2,CAN,male,5/27/92,1.98,79.0,athletics,0,0,1
3,MDA,male,1/2/91,1.83,80.0,taekwondo,0,0,0
4,NZL,male,11/26/90,1.81,71.0,cycling,0,0,0

In [60]:
# Transform height and weight to inches and pounds:
# 1 meter = 39.3700787 inches
# 1 kg = 2.20462262 pounds

inches = 39.3700787
pounds = 2.20462262

# element-wise operations
df["height(in)"] = df["height"]*inches 
df["weight(lbs)"] = df["weight"]*pounds 

df.head()

,nationality,sex,dob,height,weight,sport,gold,silver,bronze,height(in),weight(lbs)
0,ESP,male,10/17/69,1.72,64.0,athletics,0,0,0,67.716535,141.095848
1,KOR,female,9/23/86,1.68,56.0,fencing,0,0,0,66.141732,123.458867
2,CAN,male,5/27/92,1.98,79.0,athletics,0,0,1,77.952756,174.165187
3,MDA,male,1/2/91,1.83,80.0,taekwondo,0,0,0,72.047244,176.369810
4,NZL,male,11/26/90,1.81,71.0,cycling,0,0,0,71.259842,156.528206

---

## Feature Engineering

In [61]:
# Combine height and weight into "bmi" feature
# bmi = weight(kg)/height(m)**2

df["bmi"] = df["weight"]/(df["height"]**2)
df.head()

,nationality,sex,dob,height,weight,sport,gold,silver,bronze,height(in),weight(lbs),bmi
0,ESP,male,10/17/69,1.72,64.0,athletics,0,0,0,67.716535,141.095848,21.633315
1,KOR,female,9/23/86,1.68,56.0,fencing,0,0,0,66.141732,123.458867,19.841270
2,CAN,male,5/27/92,1.98,79.0,athletics,0,0,1,77.952756,174.165187,20.151005
3,MDA,male,1/2/91,1.83,80.0,taekwondo,0,0,0,72.047244,176.369810,23.888441
4,NZL,male,11/26/90,1.81,71.0,cycling,0,0,0,71.259842,156.528206,21.672110

In [ ]:
# Create a feature representing total medals won:

df["medal_ct"] = df["gold"] + df["silver"] + df["bronze"]
df.head()

In [ ]:
# Alternative method for creating a feature representing the sum of medals won:

df["medal_ct"] = df[["gold", "silver", "bronze"]].sum(axis = 1)
df.head()

---

### Drop Features

In [ ]:
# Drop columns

df = df.drop(["height", "weight", "height(in)", "weight(lbs)"], axis=1)
df.head()

---

## Get the top n of a feature

In [ ]:
# Features must be in a list, even if there's only one.
# Sort the rows by the indicated column

df[["nationality", "sport", "medal_ct"]].nlargest(10, columns="medal_ct")

In [ ]:
# Sort the rows by the indicated column

df[["nationality", "sport", "bmi"]].nsmallest(10, columns="bmi")

## Sort by a feature

In [ ]:
df[["nationality", "sport", "bmi"]].sort_values(by="bmi", ascending=True)

---

## Boolean Selection

In [ ]:
df["sport"]=="tennis"

In [ ]:
df["sport"].isin(["tennis"])

In [ ]:
# isin() is like using an "or" statement

df["sport"].isin(["tennis", "table tennis"])

### Using boolean for row selection

In [ ]:
df.loc[df["sport"].isin(["tennis","table tennis"]), ["sport", "sex"]]

---

## Useful methods

### mode()

In [ ]:
df.loc[df["sport"].isin(["tennis","table tennis"]), "sex"].mode()

### median()

In [ ]:
df.loc[df["sport"].isin(["tennis","table tennis"]), "bmi"].median()

### sum()
#### Sum over a column in a selection

In [ ]:
df.loc[df["sport"].isin(["tennis","table tennis"]), "medal_ct"].sum()

### count()
#### Returns the number of rows included in a selection

In [ ]:
df.loc[df["sport"].isin(["tennis","table tennis"]), "sport"].count()

### value_counts()
#### Returns the count of each unique category for a column in a selection

In [ ]:
df.loc[df["sport"].isin(["tennis","table tennis"]), "sport"].value_counts()

---

# Interview the data

### And (&) operation

#### How many athletes are clinically obese and won a gold medal?

In [ ]:
df.loc[(df["bmi"] > 29) & (df["gold"] > 0), 'sport'].count()

#### How many athletes are clinically underweight and compete for the "USA"?

In [ ]:
df.loc[(df["bmi"] < 19) & (df["nationality"] == "USA"), "sport"].count()

### Or ( | ) operation

#### How many athletes, by sport,  are either clinically underweight or clinically obese and won any medal?

In [ ]:
df.loc[((df["bmi"] < 19) | 
        (df["bmi"] > 29)) & 
        (df["medal_ct"] > 0), "sport"].value_counts()

---

## Getting the max and min counts for value_counts()

#### Get the largest quantity for value_counts() by using index [0]

In [ ]:
df.loc[((df["bmi"] < 19) | 
        (df["bmi"] > 29)) & 
        (df["medal_ct"] >0), "sport"].value_counts()[0] # [-1]

#### Get category associated with the largest quantity for value_counts() by using idxmax()

In [ ]:
df.loc[((df["bmi"] < 19) | 
        (df["bmi"] > 29)) & 
        (df["medal_ct"] >0), "sport"].value_counts().idxmax() # .idxmin()

---

## Export DataFrame

### to csv

In [71]:
#df.to_csv("my_data.csv", index=False)

### to Excel

In [72]:
#df.to_excel("my_data.xlsx", index=False)